{
    "Meal": [
        {
            "directions": [
                "Preheat oven to 350 degrees F (175 degrees C). Lightly grease cookie sheets.",
                "In a large bowl, stir together cake mix, instant pudding, and rolled oats. Add oil, sour cream, water, and vanilla; mix until smooth and well blended. Stir in chocolate chips. Roll dough into 1 1/2 inch balls, and place 2 inches apart on the prepared cookie sheets.",
                "Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."
            ],
            "ingredients": [
                "1 (18.25 ounce) package white cake mix",
                "1 (3.4 ounce) package instant butterscotch pudding mix",
                "2/3 cup rolled oats",
                "1/2 cup vegetable oil",
                "1/2 cup sour cream",
                "1/4 cup water",
                "2 teaspoons vanilla extract",
                "1 cup semisweet chocolate chips"
            ],
            "source": "allrecipes.com",
            "title": "Aaron's Chocolate Chunk Oatmeal Cookies",
            "url": "https://www.justapinch.com/recipes/dessert/cookies/aarons-temptation-chocolate-chip-cookies.html",
            "image": "aaron-cookie.png",
            "desc": "These are, by far, the BEST chocolate chip cookies I have ever had. I came up with the recipe about 8 years ago and my husband, Aaron, for whom they are named, can't resist them!"
        },
        
        {
            "directions": [
                "Cream together butter and sugar in a large bowl. Add eggs and beat until light and fluffy. Combine the nutmeg, salt, baking soda, and baking powder in a small bowl. Stir in the buttermilk and add this mixture to the creamed ingredients. Gradually stir in the flour one cup at a time. If dough is still too sticky to roll, gradually add more flour until you can form the dough into a ball. Cover and chill dough for at least an hour.",
                "Preheat oven to 350 degrees F (175 degrees C). Roll dough out to 1/4 inch thickness on a lightly floured surface. Cut into shapes and place on ungreased cookie sheet.",
                "Bake until no indentation remains when cookies are lightly touched, about 10 minutes. Cool cookies on rack."
            ],
            "ingredients": [
                "1 cup butter, softened",
                "1 1/2 cups white sugar",
                "2 eggs",
                "1 teaspoon ground nutmeg",
                "1/2 teaspoon salt",
                "1/2 teaspoon baking soda",
                "2 teaspoons baking powder",
                "1 cup buttermilk",
                "3 cups all-purpose flour, or as needed"
            ],
            "source": "allrecipes.com",
            "title": "Grandma Abbey's Christmas Cookies",
            "url": "http://allrecipes.com/recipe/154336/grandma-abbeys-christmas-cookies/",
            "image": "christmas-cookie.png",
            "desc": "Grandma Abbey made these cookies for my MIL (her granddaughter) when she was a child in the 1930's. They're my husband's favorite. With a delicate nutmeg flavor, they stand up nicely to frosting. "
        },

        {
            "directions": [
                "Smear a small amount of frosting onto the flat bottom of a candy kiss. Press onto the flat bottom of the vanilla wafer. Smear a little more frosting onto the flat bottom of a butterscotch chip, and press onto the rounded top of the cookie. Repeat with remaining ingredients. Set aside to dry, about 30 minutes."
            ],
            "ingredients": [
                "1 tablespoon prepared chocolate frosting",
                "24 milk chocolate candy kisses (such as Hershey's Kisses®), unwrapped",
                "24 mini vanilla wafer cookies (such as Nilla®)",
                "24 butterscotch chips"
            ],
            "source": "allrecipes.com",
            "title": "Acorn Candy Cookies",
            "url": "http://allrecipes.com/recipe/216459/acorn-candy-cookies/",
            "image": "acorn-cookie.png",
            "desc": "Cute little treats all on their own or a fun decoration for your cupcakes! Enjoy as is or use to decorate cupcakes."
        },

        {
            "directions": [
                "Adjust rack in oven to lower third. Preheat oven to 425 degrees F (220 degrees C).",
                "Combine 3 cups flour, 1 1/2 cup plus 1 tablespoon cold butter, 2 tablespoons sugar, and salt in a food processor. Pulse until coarse meal forms. Add remaining 1 cup flour; pulse to incorporate. Alternate adding vodka and water to flour mixture a tablespoon at a time, pulsing until dough forms into a ball.",
                "Divide the dough in half and shape into balls. Roll out each ball to fit a 12-inch deep-dish pie plate. Place bottom crust in pie plate. Brush 1/2 of egg wash over bottom pie crust.",
                "Bring 3 quarts water to a boil in a large stock pot. Remove from heat. Add apples and let stand 10 minutes; drain. Toss lemon juice and zest together with apples in a large bowl.",
                "Combine 1 cup sugar, 2 tablespoons flour, apple pie spice, and cinnamon together in a small bowl.",
                "Place 1 layer of apples onto pie crust; sprinkle with some of the spice mixture. Repeat with remaining apples and spice mixture, reserving 1 tablespoon of the spice mixture for top crust. Cover apples with top pie crust; brush with remaining egg wash and sprinkle with remaining spice mixture.",
                "Bake in the preheated oven for 20 minutes. Reduce temperature to 350 degrees F (175 degrees C); bake until golden brown, 25 to 30 minutes more."
            ],
            "ingredients": [
                "Crust:",
                "4 cups all-purpose flour, divided",
                "1 1/2 cups cold butter",
                "1 tablespoon cold butter",
                "2 tablespoons white sugar",
                "1 teaspoon salt",
                "1/4 cup vodka, or as needed",
                "1/4 cup cold water, or as needed",
                "Egg Wash:",
                "1 egg, beaten",
                "Filling:",
                "4 pounds Granny Smith apples - peeled, cored, and sliced",
                "1/2 lemon, zested and juiced",
                "1 cup white sugar",
                "2 tablespoons all-purpose flour",
                "2 teaspoons apple pie spice (such as Penzeys®)",
                "1/2 teaspoon ground cinnamon"
            ],
            "source": "allrecipes.com",
            "title": "Adam's 12-inch Deep-Dish Apple Pie",
            "url": "http://allrecipes.com/recipe/245582/adams-12-inch-deep-dish-apple-pie/",
            "image": "adam-12inch.png",
            "desc": "Large 12-inch deep dish apple pie, a classic pie with buttery crust, tart apples, and spices."
        },

        {
            "directions": [
                "Preheat an oven to 350 degrees F (175 degrees C).",
                "Spray a 9x13-inch baking pan with cooking spray.",
                "Combine flour, sugar, vegetable oil, eggs, salt, baking soda, vanilla extract, and cinnamon in a large bowl; mix well.",
                "Stir in the chopped apples until just combined.",
                "Pour batter into the prepared baking pan.",
                "Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour."
            ],
            "ingredients": [
                "cooking spray",
                "3 cups all-purpose flour",
                "2 cups white sugar",
                "3/4 cup vegetable oil",
                "3 eggs",
                "1 teaspoon salt",
                "1/2 teaspoon baking soda",
                "1 teaspoon vanilla extract",
                "1 teaspoon ground cinnamon",
                "4 apples - peeled, cored and chopped"
            ],
            "source": "allrecipes.com",
            "title": "Adam's Apple Cake",
            "url": "http://allrecipes.com/recipe/220480/adams-apple-cake/",
            "image": "adam-cake.png",
            "desc": "This simple, delicious apple cake recipe has been in our family for generations."
        },

        {
            "directions": [
                "Sift together the flour, baking soda, and salt. Set aside. In a medium bowl, cream the white sugar, brown sugar, and the butter together until smooth. Stir in the eggs and vanilla. Add the flour mixture, and stir until just combined.  Stir the crushed cookies into the dough. Cover, and chill the dough for 1/2 hour.",
                "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.",
                "Drop dough by rounded spoonfuls onto prepared cookie sheets. Bake for 10 to 11 minutes in the preheated oven. Remove to cool on wire racks."
            ],
            "ingredients": [
                "2 1/4 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1 teaspoon salt",
                "1 cup white sugar",
                "1/2 cup packed brown sugar",
                "1 cup butter, softened",
                "2 eggs",
                "1 teaspoon vanilla extract",
                "1 1/2 cups chocolate sandwich cookie crumbs"
            ],
            "source": "allrecipes.com",
            "title": "Adam's Dirt Cookies",
            "url": "http://allrecipes.com/recipe/14992/adams-dirt-cookies/",
            "image": "dirt-cookies.png",
            "desc": "Why smash perfectly good cookies just to make another batch of cookies? 'Cause they're YUMMY! Made with crushed sandwich cookies, the small pieces of broken cookie dust make the dough speckled - I've been told they look like they're made with dirt!"
        },

        {
            "directions": [
                "Preheat oven to 350 degrees F (175 degrees C).",
                "To Make Crust: In a large bowl, mix together 1 1/2 cups flour, oil, milk, 1 1/2 teaspoons sugar and salt until evenly blended. Pat mixture into a 9 inch pie pan, spreading the dough evenly over the bottom and up sides. Crimp edges of the dough around the perimeter.",
                "To Make Filling: Mix together 3/4 cup sugar, 3 tablespoons flour, cinnamon, and nutmeg. Sprinkle over apples and toss to coat. Spread evenly in unbaked pie shell.",
                "To Make Topping: Using a pastry cutter, mix together 1/2 cup flour, 1/2 cup sugar and butter until evenly distributed and crumbly in texture. Sprinkle over apples.",
                "Put pie in the oven on a cookie sheet to catch the juices that may spill over. Bake 45 minutes."
            ],
            "ingredients": [
                "1 1/2 cups all-purpose flour",
                "1/2 cup vegetable oil",
                "2 tablespoons cold milk",
                "1 1/2 teaspoons white sugar",
                "1 teaspoon salt",
                "6 Fuji apples, cored and sliced",
                "3/4 cup white sugar",
                "3 tablespoons all-purpose flour",
                "3/4 teaspoon ground cinnamon",
                "1/2 teaspoon ground nutmeg",
                "1/2 cup all-purpose flour",
                "1/2 cup white sugar",
                "1/2 cup butter"
            ],
            "source": "allrecipes.com",
            "title": "All American Apple Pie",
            "url": "http://allrecipes.com/recipe/18353/all-american-apple-pie/",
            "image": "american-pie.png",
            "desc": "Quick and easy, with a great non-crust topping. Try a variety of apples, mix it up..."
        }
    ]
}