{
    "Meal":  [
        {
            "directions": [
                "Preheat oven to 425 degrees F (220 degrees C).",
                "Place chicken in a large baking dish. Spread pink salt and 1 tablespoon pepper evenly inside the cavity. Stuff the cavity with celery.",
                "Coat chicken skin with olive oil. Sprinkle with remaining pepper and kosher salt.",
                "Roast in the preheated oven until the juices run clear and an instant-read thermometer inserted into the thickest part of the thigh, near the bone, reads 165 degrees F (74 degrees C), about 1 1/2 hours.",
                "Cover chicken with aluminum foil and allow to rest for 10 minutes before serving."
            ],
            "ingredients": [
                "¼ cup olive oil",
                "1½ cups diced yellow onion",
                "1½ tsp. kosher salt divided",
                "½ tsp. ground black pepper",
                "1/8 tsp. crushed red pepper flakes",
                "4 garlic cloves minced",
                "1 cup vodka",
                "1 28 oz. can whole tomatoes crushed",
                "2 Tbsp. tomato paste",
                "16 oz. dried penne pasta",
                "½ cup heavy whipping cream",
                "½ cup grated Parmesan cheese plus additional for garnish",
                "Chopped fresh parsley or basil for garnish"

            ],
            "source": "allrecipes.com",
            "title": "Penne alla Vodka",
            "url": "https://preppykitchen.com/penne-alla-vodka/",
            "image": "penne-alla-vodka.png",
            "desc": "Make the most incredible Penne alla Vodka at home! A creamy and luscious tomato vodka sauce tossed with al dente penne pasta and topped with fresh herbs and parmesan. Delicious and easy!"
        },
        {
            "directions": [
                "Preheat oven to 425 degrees F (220 degrees C).",
                "Place chicken in a large baking dish. Spread pink salt and 1 tablespoon pepper evenly inside the cavity. Stuff the cavity with celery.",
                "Coat chicken skin with olive oil. Sprinkle with remaining pepper and kosher salt.",
                "Roast in the preheated oven until the juices run clear and an instant-read thermometer inserted into the thickest part of the thigh, near the bone, reads 165 degrees F (74 degrees C), about 1 1/2 hours.",
                "Cover chicken with aluminum foil and allow to rest for 10 minutes before serving."
            ],
            "ingredients": [
                "1 whole chicken, giblets removed",
                "3 tablespoons Himalayan pink salt",
                "1 ½ tablespoons ground black pepper, divided",
                "3 stalks celery, halved",
                "1 tablespoon olive oil, or to taste",
                "1 tablespoon kosher sea salt"
            ],
            "source": "allrecipes.com",
            "title": "Abbey's Best Roast Chicken",
            "url": "http://allrecipes.com/recipe/255246/abbeys-best-roast-chicken/",
            "image": "roast-chicken.png",
            "desc": "This is the best roast chicken I have ever made, and I won't make it any other way now!"
        },

        {
            "directions": [
                "Preheat oven to 325 degrees F (165 degrees C).",
                "Pound chicken breasts flat, and lay them on work surface. Sprinkle liberally with Parmesan cheese on both sides. Place a pinch of minced garlic and 1 teaspoon butter in the center of each breast. Cover each breast with a layer of prosciutto and mozzarella cheese. Reserve some of the prosciutto to place on top of the chicken. Roll up each chicken breast, and secure with toothpicks.",
                "In a 9x13 inch baking dish, combine white wine and olive oil. Arrange chicken rolls in dish. Place a small piece of prosciutto on top of each roll, and sprinkle with pepper.",
                "Bake in preheated oven for 30 minutes, or until chicken is no longer pink, an juices run clear."
            ],
            "ingredients": [
                "6 skinless, boneless chicken breast halves",
                "1/2 cup shredded Parmesan cheese",
                "1 clove garlic, finely chopped",
                "4 teaspoons butter",
                "4 ounces thinly sliced prosciutto",
                "10 ounces sliced whole milk mozzarella cheese",
                "1/3 cup white wine",
                "1/4 cup olive oil",
                "1 pinch black pepper"
            ],
            "source": "allrecipes.com",
            "title": "Abby's Chicken Rollatini",
            "url": "http://allrecipes.com/recipe/57532/abbys-chicken-rollatini/",
            "image": "chicken-rollatini.png",
            "desc": "This rollatini chicken is much like chicken saltimbocca, smothered in Parmesan cheese, rolled with mozzarella and prosciutto, then baked in white wine."
        },

        {
            "directions": [
                "Season chicken with 1/2 tablespoon chili powder, salt and pepper. Heat oil in a large skillet over medium high heat and saute seasoned chicken for 3 to 4 minutes, or until no longer pink. Remove from skillet with a slotted spoon and keep warm.",
                "In same skillet, stir fry bell pepper and onion until soft. Add jalapeno peppers, tomatoes, remaining 1/2 tablespoon chili powder and hot pepper sauce. Cook, stirring, for an additional 3 to 5 minutes; add chicken and stir fry for 2 minutes more."
            ],
            "ingredients": [
                "2 skinless, boneless chicken breast halves - cut into bite-size pieces",
                "1 tablespoon chili powder, divided",
                "salt and pepper to taste",
                "1 tablespoon olive oil",
                "1 cup chopped green bell pepper",
                "1/2 cup chopped onion",
                "2 jalapeno peppers, seeded and minced",
                "1 large tomato, cut into chunks",
                "10 drops hot pepper sauce"
            ],
            "source": "allrecipes.com",
            "title": "Acapulco Chicken",
            "url": "http://allrecipes.com/recipe/19123/acapulco-chicken/",
            "image": "acapulco-chicken.png",
            "desc": "Easy, fast, healthy, and delicious! This perfect weeknight Acapulco chicken dish takes less than 30 minutes, so it's a regular in our house. You can vary the heat by the kind and amount of chili powder and hot peppers you use. Serve over hot cooked rice, if desired."
        },

        {
            "directions": [
                "Heat a dry medium skillet, preferably cast iron, over medium-high. Season steak all over with salt and pepper and cook, turning several times, until lightly charred, 7–9 minutes for medium-rare. Transfer to a cutting board; let rest at least 15 minutes before thinly slicing against the grain.",
                "Meanwhile, toss lentils with 2 Tbsp. pesto in a small bowl and season with salt.",
                "Divide lentil mixture between shallow bowls or plates and top with steak and some feta and roasted squash. Finish with a handful of almonds. Serve with more pesto alongside."
            ],
            "ingredients": [
                "1 (12-ounce) boneless strip steak",
                "Kosher salt, freshly ground pepper",
                "1 cup Sprouted Red Lentils",
                "2 tablespoons Horseradish-Pumpkin Seed Pesto, plus more",
                "Marinated Feta with Roasted Lemon, Coconut-Oil Roasted Squash with Nutritional Yeast, and coarsely chopped almonds (for serving)"
            ],
            "source": "www.epicurious.com",
            "title": "Strip Steak with Roasted Acorn Squash and Sprouted Lentils",
            "url": "http://www.epicurious.com/recipes/food/views/strip-steak-with-roasted-acorn-squash-and-sprouted-lentils",
            "image": "steak-acorn.png",
            "desc": "This steak, with lentils, squash, pesto, almonds, and marinated feta, will be unlike anything you've ever tried before. In a good way."
        },

        {
            "directions": [
                "Place the salmon fillets in an 8x8-inch microwave-safe baking dish, and place the onion and tomato on the fillets. Sprinkle with garlic powder and onion powder, drizzle with white wine and olive oil, and wrap the dish with plastic wrap.",
                "Microwave on High power setting until the salmon is opaque, about 6 minutes. Carefully peel off the plastic wrap to avoid steam, and season with salt and pepper to taste."
            ],
            "ingredients": [
                "1 pound salmon fillets, skin removed",
                "1/2 white onion, thinly sliced",
                "1/2 tomato, diced",
                "1 tablespoon garlic powder, or to taste",
                "1 tablespoon onion powder, or to taste",
                "2 tablespoons white wine",
                "2 tablespoons extra-virgin olive oil",
                "sea salt and fresh black pepper to taste"
            ],
            "source": "allrecipes.com",
            "title": "Easy Salmon Acqua Pazza",
            "url": "http://allrecipes.com/recipe/205667/easy-salmon-acqua-pazza/",
            "image": "salmon-acca-pazza.png",
            "desc": "Microwave salmon fillets for 6 minutes. That's all!"
        },

        {
            "directions": [
                "Preheat oven to 350 degrees F (175 degrees C). Rinse the duck, remove any pieces of excess fat from around the cavity, and prick the duck's skin all over with a fork or sharp skewer, being careful not to puncture the meat.",
                "Rub the skin of the duck and inside the duck cavity with 1 tablespoon of orange juice concentrate. Rub 1 teaspoon  of minced garlic inside and outside the duck, and sprinkle the duck, inside and outside, with salt and pepper.",
                "Mix together about 2 tablespoons of chopped onion, the raisins, and apple in a bowl, and lightly stuff the cavity of the duck with the raisin mixture. Truss the duck, and place it onto a rack set in a roasting pan. Scatter the remaining chopped onion and slices of large carrot in the roasting pan around the duck.",
                "To make basting mixture, whisk together remaining orange juice concentrate, 1/2 cup of chicken broth, 1/4 cup lemon juice, and salt and pepper in a bowl.",
                "Roast the duck in the preheated oven for 1 hour, basting occasionally with the basting mixture. After 1 hour, pour off the rendered fat, and roast, basting occasionally, until no longer pink at the bone and the juices run clear, about 1 more hour. An instant-read thermometer inserted into the thickest part of the thigh should read 165 degrees F ( 74 degrees C).  Reserve any left-over basting mixture.",
                "While the duck is roasting, prepare duck stock. Heat olive oil in a saucepan, and brown the reserved neck and giblets over medium heat. Stir in 1 onion, 2 garlic cloves, and 1 carrot, and cook and stir until the onion is translucent, about 5 minutes. Stir in 1 cup chicken broth, 1/2 cup lemon juice, orange juice, parsley, and salt and pepper, bring to a boil, and cover. Reduce heat and simmer for 1 hour; strain the stock and set aside.",
                "Remove the duck from the oven and place on a warm platter. Arrange cooked vegetables around the duck, if desired. Remove stuffing to a serving bowl. Let the duck rest about 15 minutes before carving.",
                "While the duck is resting, finish the sauce. Skim fat out of the roasting pan, and pour reserved basting mixture into the pan, stirring and scraping to dissolve the brown bits of flavor from the bottom of the pan. Bring the mixture to a boil over medium heat, and stir in the reserved duck stock. Bring back to a boil, and cook the sauce down by about half, stirring constantly to prevent burning, about 10 minutes. Whisk in sour cream to make a smooth, glossy sauce. Pour the sauce over the carved duck to serve."
            ],
            "ingredients": [
                "1 (5 pound) whole duck, neck and giblets reserved",
                "1 (6 ounce) can orange juice concentrate, thawed, divided",
                "1 teaspoon minced garlic",
                "salt and freshly ground black pepper to taste",
                "Stuffing:",
                "1 onion, coarsely chopped, divided",
                "1 cup raisins",
                "1 apple - peeled, cored, and cut into chunks (optional)",
                "1 large carrot, thickly sliced",
                "Basting sauce:",
                "1/2 cup chicken broth",
                "1/4 cup lemon juice (see Cook's Note)",
                "salt and freshly ground black pepper to taste",
                "Duck Stock:",
                "1 tablespoon olive oil",
                "1 onion, coarsely chopped",
                "2 cloves garlic, minced",
                "1 carrot, thickly sliced",
                "1 cup chicken broth",
                "1/2 cup lemon juice (see Cook's Note)",
                "1 cup orange juice",
                "1 sprig fresh parsley, chopped",
                "salt and freshly ground black pepper to taste",
                "1 tablespoon sour cream"
            ],
            "source": "allrecipes.com",
            "title": "Adams Family Duck",
            "url": "http://allrecipes.com/recipe/212667/adams-family-duck/",
            "image": "adam-duck.png",
            "desc": "This is a special treat I prepare for my family. The fruity stuffing makes the duck doubly delicious, and the preparation is fairly lean for such a normally fatty meat. Pretty sophisticated stuff, but not expensive to prepare. We truly enjoy it and hope you will, too :)"
        },

        {
            "directions": [
                "1. Preheat the oven to 350°F.",
                "2. Put the beef, veal, and pork into a bowl and kneed them together.",
                "3. Pour the milk into a bowl and soak the bread in it, squeezing it into a paste. Add the soaked bread to the bowl with the meat and work them together as though you were kneading dough. Add the cheese, garlic, onion, eggs, oregano, and parsley. Season with salt and pepper and knead again until well incorporated.",
                "4. Oil a large roasting pan with the olive oil. Form the meat mixture into a large loaf in the center of a roasting pan.",
                "5. Stir in the plum tomatoes, tomato paste, and 1 cup water together in a bowl and pour the mixture evenly over the meatloaf. Scatter the carrots and celery in the pan around the loaf.",
                "6. Put the pan in the oven and bake until a skewer inserted in the center of the loaf comes out warm, about 1 1/2 hours. If the loaf begins to look dry while cooking, tent it with aluminum foil. Remove the pan from the oven and let it cool slightly.",
                "7. Slice the meatloaf into servings, put 1 serving on each plate and spoon pan gravy and vegetables over and around the meatloaf.",
                "You can make the loaf with beef and veal only, or with just beef.",
                "Lay some raw bacon strips over the loaf before baking. (This was one way my mother made her meatloaf extra special.)",
                "Add some sautéed mushrooms to the pan during the last 20 minutes of cooking."
            ],
            "ingredients": [
                "1 pound ground beef",
                "1 pound ground pork",
                "1 pound ground veal",
                "1 cup milk",
                "1 cup bread cubes (3 or 4 slices Italian country bread, crusts removed)",
                "1/2 cup finely grated pecorino Romano",
                "2 tablespoons minced garlic",
                "1 onion, cut into small dice",
                "2 eggs",
                "2 tablespoons dried oregano",
                "1/2 cup chopped flatleaf parsley",
                "Fine sea salt and freshly ground black pepper",
                "Olive oil, for greasing",
                "1 cup canned plum tomatoes, crushed",
                "2 tablespoons tomato paste",
                "1 medium carrot, diced",
                "1 stalk celery, diced"
            ],
            "source": "www.epicurious.com",
            "title": "My Mother's Italian-American Meatloaf",
            "url": "http://www.epicurious.com/recipes/food/views/my-mothers-italian-american-meatloaf-232204",
            "image": "mom-meatloaf.png",
            "desc": "We all have memories either of great or terrible meatloaf meals from childhood. My mom's meatloaf is a fond food memory. It was always moist and juicy, with a touch of Italy from the tomatoes and pecorino Romano cheese."
        },

        {
            "directions": [
                "Wash the chicken and pat dry. Put the pieces into a large nonreactive glass or stainless steel bowl and pour the lime juice over them. Sprinkle with the minced garlic, a large pinch of salt, and several liberal grindings of black pepper. Toss until the seasoning is uniformly distributed and set aside to marinate for at least 1 hour, refrigerated. (Or cover and marinate overnight in the refrigerator; remove from the refrigerator 30 minutes before you are ready to cook the chicken.)",
                "Place the corn flour in a paper or large plastic ziplock bag. Shake to coat the inside. Fit a wire cooling rack over a cookie sheet and place it in the center of the oven. Preheat the oven to 150°F (or Warm setting). Fill a deep cast-iron skillet, Dutch oven, or deep-fat fryer with enough lard or oil to come halfway up the sides, at least 2 inches deep. Over medium-high heat, bring the fat to 375°F (hot but not smoking).",
                "When the fat is hot, lift the chicken pieces a few at a time from their marinade, allowing the excess to flow back into the bowl. Drop them into the bag of corn flour, close the top, and shake until the chicken is well coated. Lift them out of the corn flour, shake off the excess, and slip them into the fat. Repeat until the pan is full without crowding. Fry, maintaining a temperature of 365°F, turning once, until the chicken is a rich golden brown and cooked through, 12 to 15 minutes.",
                "Lift the chicken from the fat, drain well, and transfer to the wire rack in the oven while you fry the remaining chicken. Serve hot, with hot sauce and lime wedges passed separately.",
                "Note: If you like, you can spice up the marinade with a few hot red pepper flakes or with a few shots of hot sauce. Other common additions to the marinade are minced fresh ginger (about 2 quarter-sized slices, minced fine), rum, sugar, and chopped cilantro."
            ],
            "ingredients": [
                "1 frying chicken, weighing no more than 3 pounds, cut up for frying Chinese-style, or 8 chicken thighs, chopped in half crosswise",
                "1/2 cup freshly squeezed lime juice",
                "2 garlic cloves, minced",
                "salt and freshly milled black pepper",
                "1 cup corn flour (very fine cornmeal — not cornstarch)",
                "lard or peanut or vegetable oil, for frying",
                "hot sauce",
                "2 limes, cut into wedges"
            ],
            "source": "www.epicurious.com",
            "title": "South American Fried Chicken",
            "url": "http://www.epicurious.com/recipes/food/views/south-american-fried-chicken-101853",
            "image": "pollo.png",
            "desc": "Pollo Campero is a restaurant chain that originated in Guatemala and is now famous throughout much of Central America and beyond—in particular for the juicy, flavorful, and richly spiced fried chicken recreated by this recipe."
        },

        {
            "directions": [
                "Mix onion, garlic, ginger, gochujang, soy sauce, sugar, mirin, sesame oil, and 1 tsp. pepper in a medium bowl to combine; set sauce aside.",
                "Toss rice, cumin, garlic powder, and mustard powder in a medium bowl to combine; spread out on a parchment-lined rimmed baking sheet and chill until cold, about 1 hour.",
                "Meanwhile, season chicken generously with salt. Heat butter and vegetable oil in a medium heavy pot over medium. As soon as foaming subsides, add chicken and cook, turning occasionally, until lightly browned, about 5 minutes. Add reserved sauce and bring to a simmer; cook until sauce appears to thin out, about 3 minutes. Add broth and bring to a boil. Reduce heat, partially cover pot, and simmer, turning occasionally, until chicken is very tender, 45–55 minutes.",
                "Divide rice into 4 portions; form into 3/4\"-thick disks (moisten hands with water to prevent sticking). Heat a large nonstick skillet over medium. Working in 2 batches, cook rice cakes, turning halfway through, until crisp, puffed, and golden, about 10 minutes. Transfer to plates.",
                "Add scallions to chicken and cook until tender, about 3 minutes. Season with salt and pepper. Top each cake with 2 chicken legs and a few scallions; spoon plenty of sauce over."
            ],
            "ingredients": [
                "1 small onion, finely chopped",
                "8 garlic cloves, finely grated",
                "1 (2-inch) piece ginger, peeled, finely grated",
                "1/4 cup gochujang (Korean hot pepper paste)",
                "1/4 cup soy sauce",
                "2 tablespoons sugar",
                "1 tablespoon mirin",
                "1 tablespoon toasted sesame oil",
                "1 teaspoon freshly ground black pepper, plus more",
                "3 cups cooked short-grain rice",
                "1 teaspoon ground cumin",
                "1/2 teaspoon garlic powder",
                "1/2 teaspoon mustard powder",
                "8 chicken drumsticks, patted dry",
                "Kosher salt",
                "4 tablespoons unsalted butter",
                "2 tablespoons vegetable oil",
                "4 cups low-sodium chicken broth",
                "6 scallions, white and pale-green parts only, cut into 1-inch pieces"
            ],
            "source": "www.epicurious.com",
            "title": "Gochujang-Braised Chicken and Crispy Rice",
            "url": "http://www.epicurious.com/recipes/food/views/gochujang-braised-chicken-and-crispy-rice",
            "image": "gochujang.png",
            "desc": "Long-grain rice is not starchy enough to hold together, so make a batch of short-grain a day ahead and you’ll be good to go."
        }
    ]
}